/**
 * ==========================================================
 * Theme Ontology
 * ==========================================================
 *
 * Companion Type을
 * 추천 가능한 관광 테마로 매핑한다.
 *
 * 논문의 핵심 온톨로지이다.
 * ==========================================================
 */

module.exports = {
    혼자: [
        "자연관광",
        "문화관광"
    ],

    연인: [
        "문화관광",
        "레저스포츠",
        "쇼핑"
    ],

    친구: [
        "레저스포츠",
        "쇼핑",
        "문화관광"
    ],

    가족: [
        "자연관광",
        "문화관광",
        "체험관광"
    ],

    아이동반: [
        "체험관광",
        "자연관광",
        "문화관광"
    ],

    부모님: [
        "자연관광",
        "역사관광",
        "문화관광"
    ],

    단체: [
        "체험관광",
        "레저스포츠",
        "문화관광"
    ]
};
